package leetCode.java;

//2D-DP O(n^3) O(n^2)
class Solution312 {
    public int maxCoins(int[] nums) {
        int n = nums.length;
        int[][] dp = new int[n + 2][n + 2]; // dp[i][j]表Burst掉區間[i,j]內所有氣球, 可以得到的最大可能
        int[] points = new int[n + 2]; // 頭尾加入1方便計算
        points[0] = 1;
        points[n + 1] = 1;
        for (int i = 0; i < n; ++i) {
            points[i + 1] = nums[i];
        }

        //dp[i][j] 依賴任意更短的片段在[i,j]區間, 所以要先算短區間, 再算長區間(Interval DP)
        for (int len = 0; len < n; ++len) { // len區間為[0,n-1], ex:nums=[1,2,3]距離最多只有2
            //i <= k <= j, 找max([i]~[k-1] + [i-1]*[k]*[j+1] + [k+1]~[j])
            for (int i = 1; i + len <= n; ++i) { //頭尾+1所以氣球區間是[1,n]
                int j = i + len;
                for (int k = i; k <= j; ++k) {
                    dp[i][j] = Math.max(
                        dp[i][j],
                        dp[i][k - 1] + points[i - 1] * points[k] * points[j + 1] + dp[k + 1][j]
                    );
                }
            }
        }
        return dp[1][n]; // 所有氣球區間必為最大值
    }
}
/* 
nums = [3,1,5,8] 
前後補1 -> [1,3,1,5,8,1]

dp[i][j] 代表 Burst 掉 [i,j] 的最大可能值
k = [i,j] 中最後 Burst 的氣球

長度 1:
[3] -> k=1: 0+(1*3*1)+0=3 -> dp[1,1]=3
[1] -> k=2: 0+(3*1*5)+0=15 -> dp[2,2]=15
[5] -> k=3: 0+(1*5*8)+0=40 -> dp[3,3]=40
[8] -> k=4: 0+(5*8*1)+0=40 -> dp[4,4]=40

長度 2:
[3,1] ->
k=1: 0+(1*3*5)+15=30 -> dp[1,2]=30
k=2: 3+(1*1*5)+0=8 -> dp[1,2]=30
[1,5] ->
k=2: 0+(3*1*8)+40=64 -> dp[2,3]=64
k=3: 15+(3*5*8)+0=135 -> dp[2,3]=135
[5,8] ->
k=3: 0+(1*5*1)+40=45 -> dp[3,4]=45
k=4: 40+(1*8*1)+0=48 -> dp[3,4]=48

長度 3:
[3,5] ->
k=1: 0+(1*3*8)+135=159 -> dp[1,3]=159
k=2: 3+(1*1*8)+40=51 -> dp[1,3]=159
k=3: 30+(1*5*8)+0=70 -> dp[1,3]=159
[1,8] -> 
k=2: 0+(3*1*1)+48=51 -> dp[2,4]=51
k=3: 15+(3*5*1)+40=70 -> dp[2,4]=70
k=4: 135+(3*8*1)+0=159 -> dp[2,4]=159

長度 4:
[3,8] ->
k=1: 0+(1*3*1)+159=162 -> dp[1,4]=162
k=2: 3+(1*1*1)+48=52 -> dp[1,4]=162
k=3: 30+(1*5*1)+40=75 -> dp[1,4]=162
k=4: 159+(1*8*1)+0=167 -> dp[1,4]=167

res=167
*/